app/Controllers/Alumni.php

    public function index()
    {
        $req = $this->request->getVar();
        $alumniModel = new \App\Models\AlumniModel();
        $propinsiModel = new \App\Models\PropinsiModel();
        $occupationModel = new \App\Models\OccupationModel();
        $akademikModel = new \App\Models\AkademikModel();
        $angkatanModel = new \App\Models\AngkatanModel();
        $prodiModel = new \App\Models\ProdiModel();

        $data['request'] = $req;
        $data_alumni = $alumniModel->data_alumni($req)->paginate(10);

        $i = 0;
        foreach ($data_alumni as $dtal) {
            $data_alumni[$i]['riwayat_akademik'] = $akademikModel->where('akademik.idorg', $data_alumni[$i]['id'])->findAll();
            $i++;
        }
        $data['alumni'] = $data_alumni;
        $data['pager'] = $alumniModel->pager;
        $data['provinces'] = $propinsiModel->findAll();
        $data['prodi'] = $prodiModel->findAll();
        $data['occupations'] = $occupationModel->findAll();
        $data['jenjang'] = $akademikModel->select('jenjang')->distinct()->findAll();
        $data['universitas'] = $akademikModel->select('universitas')->distinct()->findAll();
        $data['departemen'] = $akademikModel->select('departemen')->distinct()->findAll();
        $data['angkatan'] = $angkatanModel->findAll();
---
SELECT *
FROM `akademik`
WHERE `akademik`.`idorg` = '11'
SELECT *
FROM `propinsi`
SELECT *
FROM `prodi`
SELECT *
FROM `occupations`
SELECT DISTINCT `jenjang`
FROM `akademik`
SELECT DISTINCT `universitas`
FROM `akademik`
SELECT DISTINCT `departemen`
FROM `akademik`
SELECT *
FROM `angkatan`