app/Controllers/Angkatan.php

    public function index()
    {
        $req = $this->request->getVar();
        $data['req'] = $req;

        $angkatanModel = new \App\Models\AngkatanModel();
        $data['angkatan'] = $angkatanModel->angkatan($req)->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `angkatan`