app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `username` = 'superadmin@admin.com'
 LIMIT 1
---
    public function login_post()
    {
        $input = $this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Email harus diisi',
                    'valid_email' => 'Email tidak valid',
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Email harus diisi',
                ]
            ],
        ]);


        if (!$input) {
            $validation = \Config\Services::validation();
            return redirect()->to(site_url() . 'login')->withInput()->with('validation', $validation);
        } else {

            $penggunaModel = new \App\Models\PenggunaModel();
            $alumniModel = new \App\Models\AlumniModel();
            $roleModel = new \App\Models\RoleModel();

            $email = $this->request->getVar('email');
            $password = $this->request->getVar('password');
            $user = $penggunaModel->where('username', $email)->first();

SELECT *
FROM `roles`
WHERE `roles`.`id` = '3'
---
                        return redirect()->to('login')->with('error', 'Data angkatan belum disetting, silahkan hubungi admin');
                    }

                    $role = $roleModel->find($user['role']);

SELECT `pengguna_id`, `id`
FROM `data_alumni`
WHERE `pengguna_id` = '258'
 LIMIT 1
---
                        'nama' => $user['nama'],
                    ];

                    $dataAlumni = $alumniModel->select('pengguna_id,id')->where('pengguna_id', $user['id'])->first();