app/Controllers/ChangePassword.php

    public function edit_post()
    {


        $input = $this->validate([
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Password harus diisi',
                ]
            ],
        ]);
        if (!$input) {
            $validation = \Config\Services::validation();
            return redirect()->to(site_url() . 'change_password')->withInput()->with('validation', $validation);
        } else {
            $penggunaModel = new \App\Models\PenggunaModel();
            $id = session()->get('id');
            $user = $penggunaModel->where(['id' => intval($id)])->first();
            if (!$user) {
                return redirect()->to(site_url() . 'change_password')->withInput()->with('error', 'Terjadi kesalahan');
            } else {
                $pass = $user['password'];
                $password = $this->request->getVar('password');
                $new_password = $this->request->getVar('new_password');
                $authenticatePassword = password_verify($password, $pass);
                if ($authenticatePassword) {
                    $set = [
                        'password' => password_hash($new_password, PASSWORD_DEFAULT)
                    ];
                    $idx = $penggunaModel->where('id', $id)->set($set)->update();
---
SELECT *
FROM `pengguna`
WHERE `id` = 258
 LIMIT 1
UPDATE `pengguna` SET `password` = '$2y$10$yr2FXQ.g6vGw8aMiRAhd9.xcDOLKNgpEH1aWZ/snX7kKGEFP7lNvy'
WHERE `id` = '258'