app/Controllers/Pengguna.php

INSERT INTO `pengguna` (`nama`, `username`, `role`, `active`, `angkatan`, `password`) VALUES ('Daffa Admin Angkatan', 'daffa@admin.com', '2', '1', '2021', '$2y$10$DTvBHU.Q0ijcoBTG/gpnqerJ/a/zlEMdpNQmyMa1YJr/QMpaKbErS')
---
                'angkatan' => $this->request->getVar('angkatan'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $idx = $penggunaModel->insert($data);