app/Controllers/Prodi.php

    public function index()
    {
        $req = $this->request->getVar();
        $data['req'] = $req;

        $prodiModel = new \App\Models\ProdiModel();
        $data['prodi'] = $prodiModel->prodi($req)->paginate(10);
---
SELECT *
FROM `prodi`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `prodi`