app/Controllers/ProgramSarjana.php

    public function edit($id)
    {
        $data['id'] = $id;
        $alumniModel = new \App\Models\AlumniModel();
        $akademikModel = new \App\Models\AkademikModel();
        $wisudaModel = new \App\Models\WisudaModel();

        $data['alumni'] = $alumniModel->find($id);
        $data['S1'] = $akademikModel->where('idorg', $id)->where('jenjang', 'S1')->limit(1)->get()->getRowArray();
        $data['S2'] = $akademikModel->where('idorg', $id)->where('jenjang', 'S2')->limit(1)->get()->getRowArray();
        $data['S3'] = $akademikModel->where('idorg', $id)->where('jenjang', 'S3')->limit(1)->get()->getRowArray();
        $data['wisuda'] = $wisudaModel->where('idorg', $id)->first();

        $occupationModel = new \App\Models\OccupationModel();
        $propinsiModel = new \App\Models\PropinsiModel();
        $prodiModel = new \App\Models\ProdiModel();
        $angkatanModel = new \App\Models\AngkatanModel();

        $data['occupations'] = $occupationModel->findAll();
        $data['propinsi'] = $propinsiModel->findAll();
        $data['prodi'] = $prodiModel->findAll();
        $data['angkatan'] = $angkatanModel->findAll();
---
SELECT *
FROM `data_alumni`
WHERE `data_alumni`.`id` = '4851'
SELECT *
FROM `akademik`
WHERE `idorg` = '4851'
AND `jenjang` = 'S1'
 LIMIT 1
SELECT *
FROM `akademik`
WHERE `idorg` = '4851'
AND `jenjang` = 'S2'
 LIMIT 1
SELECT *
FROM `akademik`
WHERE `idorg` = '4851'
AND `jenjang` = 'S3'
 LIMIT 1
SELECT *
FROM `wisuda`
WHERE `idorg` = '4851'
 LIMIT 1
SELECT *
FROM `occupations`
SELECT *
FROM `propinsi`
SELECT *
FROM `prodi`
SELECT *
FROM `angkatan`

                'occupation_id' => intval($this->request->getVar('bidang_kerja')),
            ];

            $update = $alumniModel->update($id, $data);
---
UPDATE `data_alumni` SET `nama` = 'Daffa Budi P', `email` = 'daffa.budi2003@gmail.com', `notelp` = '082323363405', `nowa` = '082323363405', `alamat` = 'Purwokerto', `prop_id` = 15, `instansi` = 'Kelas Inovatif', `jabatan` = 'IT', `occupation_id` = 1
WHERE `data_alumni`.`id` IN ('4851')

                    'blnwisuda' => $this->request->getVar('blnwisuda'),

                ];
                $wisudaModel->where('idorg', $id)->delete();
                $wisudaModel->insert($dataWisuda);
---
DELETE FROM `wisuda`
WHERE `idorg` = '4851'
INSERT INTO `wisuda` (`idorg`, `twisuda`, `blnwisuda`) VALUES ('4851', '2020', '1')

                    'tlulus' => $this->request->getVar('s1_tlulus'),
                    'prodi' => $this->request->getVar('s1_prodi'),
                ];
                $akademikModel->where('jenjang', 'S1')->where('idorg', $id)->delete();
                $akademikModel->insert($s1);
---
DELETE FROM `akademik`
WHERE `jenjang` = 'S1'
AND `idorg` = '4851'
INSERT INTO `akademik` (`idorg`, `jenjang`, `universitas`, `tmasuk`, `tlulus`, `prodi`) VALUES ('4851', 'S1', 'Universitas Gadjah Mada', '2019', '2022', 'Tehnik Sipil')

                    'tlulus' => $this->request->getVar('s2_tlulus'),
                    'prodi' => $this->request->getVar('s2_prodi'),
                ];
                $akademikModel->where('jenjang', 'S2')->where('idorg', $id)->delete();
                $akademikModel->insert($s2);
---
DELETE FROM `akademik`
WHERE `jenjang` = 'S2'
AND `idorg` = '4851'
INSERT INTO `akademik` (`idorg`, `jenjang`, `universitas`, `tmasuk`, `tlulus`, `prodi`) VALUES ('4851', 'S2', '', '', '', '')

                    'tlulus' => $this->request->getVar('s3_tlulus'),
                    'prodi' => $this->request->getVar('s3_prodi'),
                ];
                $akademikModel->where('jenjang', 'S3')->where('idorg', $id)->delete();
                $akademikModel->insert($s3);
---
DELETE FROM `akademik`
WHERE `jenjang` = 'S3'
AND `idorg` = '4851'
INSERT INTO `akademik` (`idorg`, `jenjang`, `universitas`, `tmasuk`, `tlulus`, `prodi`) VALUES ('4851', 'S3', '', '', '', '')

    public function detail($id)
    {
        $alumniModel = new \App\Models\AlumniModel();
        $akademikModel = new \App\Models\AkademikModel();

        $data['alumni'] = $alumniModel->getDetail($id)->get()->getRowArray();
        $data['S1'] = $akademikModel->where('idOrg', $id)->where('jenjang', 'S1')->limit(1)->get()->getRowArray();
        $data['S2'] = $akademikModel->where('idOrg', $id)->where('jenjang', 'S2')->limit(1)->get()->getRowArray();
        $data['S3'] = $akademikModel->where('idOrg', $id)->where('jenjang', 'S3')->limit(1)->get()->getRowArray();

        $occupationModel = new \App\Models\OccupationModel();
        $propinsiModel = new \App\Models\PropinsiModel();
        $prodiModel = new \App\Models\ProdiModel();
        $angkatanModel = new \App\Models\AngkatanModel();

        $data['occupations'] = $occupationModel->findAll();
        $data['propinsi'] = $propinsiModel->findAll();
        $data['prodi'] = $prodiModel->findAll();
        $data['angkatan'] = $angkatanModel->findAll();
---
SELECT *
FROM `akademik`
WHERE `idOrg` = '19'
AND `jenjang` = 'S1'
 LIMIT 1
SELECT *
FROM `akademik`
WHERE `idOrg` = '19'
AND `jenjang` = 'S2'
 LIMIT 1
SELECT *
FROM `akademik`
WHERE `idOrg` = '19'
AND `jenjang` = 'S3'
 LIMIT 1
SELECT *
FROM `occupations`
SELECT *
FROM `propinsi`
SELECT *
FROM `prodi`
SELECT *
FROM `angkatan`