app/Controllers/Propinsi.php

    public function index()
    {
        $req = $this->request->getVar();
        $data['req'] = $req;

        $propinsiModel = new \App\Models\PropinsiModel();
        $data['propinsi'] = $propinsiModel->propinsi($req)->paginate(10);
---
SELECT *
FROM `propinsi`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `propinsi`