app/Controllers/Role.php

SELECT *
FROM `roles`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `roles`
---
    public function index()
    {
        $req = $this->request->getVar();
        $data['req'] = $req;

        $roleModel = new \App\Models\RoleModel();
        $data['role'] = $roleModel->roles($req)->paginate(10);